# ------------------------------------------------------------------------------
# All the pacman packages to install on my archlinux system.
#
# You can comment a line with '#'
# Run `./exec_pacman.sh` to install all these packages
#
# For further details about pacman
# https://wiki.archlinux.org/title/Pacman
# ------------------------------------------------------------------------------


# ------------------------------------------------------------------------------
# System Core
# ------------------------------------------------------------------------------

networkmanager
network-manager-applet
inetutils

alsa-firmware
alsa-tools
alsa-utils
pipewire
pipewire-alsa
pipewire-pulse
pipewire-jack
wireplumber

acpi
linux-firmware
xf86-input-wacom
libwacom

man-db
man-pages
texinfo

reflector


# ------------------------------------------------------------------------------
# Graphics
# ------------------------------------------------------------------------------

mesa

xorg-server
xorg-xinit
xorg-xrandr
xorg-xwayland
arandr
autorandr

wayland


# ------------------------------------------------------------------------------
# System utilities
# ------------------------------------------------------------------------------

base
base-devel
stow
which
openssh

tar
zip
unzip
unrar
gzip
bzip2

bat
fzf
ripgrep
jq

rsync
ntfs-3g
dosfstools
udisks2
usbutils

android-tools
gvfs-mtp
libmtp

htop
btop


# ------------------------------------------------------------------------------
# Window Manager Environment
# ------------------------------------------------------------------------------

lightdm
lightdm-slick-greeter

i3-wm
i3status
i3status-rust
i3lock
xss-lock
dmenu
rofi
rofimoji
# rofi-power-menu (AUR)

sway
swaylock
swayidle

dex
nitrogen
dunst
pavucontrol
scrot
xfce4-screenshooter

pcmanfm-gtk3
gvfs

viewnior
mupdf
vlc
chafa


# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------

noto-fonts
noto-fonts-cjk
noto-fonts-emoji

ttf-roboto
ttf-roboto-mono

nerd-fonts
ttf-nerd-fonts-symbols

ttf-font-awesome
papirus-icon-theme


# ------------------------------------------------------------------------------
# Consoles
# ------------------------------------------------------------------------------

alacritty
rxvt-unicode
tmux

bash
bash-completion

zsh
zsh-completions
zsh-autosuggestions
zsh-syntax-highlighting
# oh-my-posh (AUR)

ranger
atool
ffmpegthumbnailer
highlight
mediainfo
odt2txt
perl-image-exiftool
poppler
python-chardet
w3m


# ------------------------------------------------------------------------------
# Programming
# ------------------------------------------------------------------------------

git
git-delta
tk

code
neovim

clang
cmake

rustup
lua
python

godot


# ------------------------------------------------------------------------------
# Softwares
# ------------------------------------------------------------------------------

darktable
krita
kdenlive
scribus
libreoffice-fresh

obs-studio
v4l2loopback-dkms

veracrypt
cryptsetup
keepassxc

firefox
discord
obsidian

sane
xsane

