# Pacman packages list for basic archlinux system

stow


# ------------------------------------------------------------------------------
# System Core
# ------------------------------------------------------------------------------

networkmanager
network-manager-applet

man-db
man-pages
texinfo

alsa-firmware
alsa-tools
alsa-utils
pipewire
pipewire-alsa
pipewire-pulse
wireplumber

acpi
linux-firmware
xf86-input-wacom
libwacom

noto-fonts
noto-fonts-cjk
noto-fonts-emoji
ttf-font-awesome


# ------------------------------------------------------------------------------
# System utilities
# ------------------------------------------------------------------------------

tar
zip
unzip
unrar
gzip
bzip2

bat
fzf
ripgrep

inetutils

rsync
ntfs-3g
openssh
htop

android-tools
usbutils
gvfs-mtp
libmtp


# ------------------------------------------------------------------------------
# i3 Window Manager
# ------------------------------------------------------------------------------

i3-wm
i3status
dmenu

dex
xss-lock
nitrogen
arandr

lightdm
lightdm-slick-greeter


# ------------------------------------------------------------------------------
# Consoles
# ------------------------------------------------------------------------------

alacritty
rxvt-unicode
tmux

bash
bash-completion

zsh
zsh-completions
zsh-autosuggestions
zsh-syntax-highlighting

ranger
atool
ffmpegthumbnailer
highlight
mediainfo
odt2txt
perl-image-exiftool
poppler
python-chardet
w3m


# ------------------------------------------------------------------------------
# Programming
# ------------------------------------------------------------------------------

git
git-delta
tk

code
neovim

clang
cmake

rustup


# ------------------------------------------------------------------------------
# Softwares
# ------------------------------------------------------------------------------

darktable
krita
kdenlive
scribus
libreoffice-fresh

obs-studio
v4l2loopback-dkms

veracrypt
cryptsetup
keepass

firefox
discord
obsidian

eog
vlc
evince

sane
xsane

