# ------------------------------------------------------------------------------
# All the pacman packages to install on my archlinux system.
#
# It allows both wayland and xorg display server
# I use i3 (x11) and sway (wayland) as my main DisplayManager
#
# You can comment a line with '#'
# Run `./exec_pacman.sh` to install all these packages
#
# For further details about pacman
# https://wiki.archlinux.org/title/Pacman
#
# AUR packages must be installed manually using the Archlinux User Repo
# See https://wiki.archlinux.org/index.php/Arch_User_Repository
# ------------------------------------------------------------------------------


# ------------------------------------------------------------------------------
# Window Manager (common)
# ------------------------------------------------------------------------------

mesa

lightdm
lightdm-slick-greeter
# lightdm-settings (AUR)

dmenu
rofi
rofimoji
# rofi-power-menu (AUR)

dex
dunst


# ------------------------------------------------------------------------------
# Window Manager (i3 - Xorg)
# ------------------------------------------------------------------------------

xorg-server
xorg-xinit
xorg-xrandr
xorg-xwayland
arandr
autorandr

i3-wm
i3status
i3status-rust
i3lock
# nitrogen (AUR)
xss-lock

xfce4-screenshooter


# ------------------------------------------------------------------------------
# Window Manager (Sway - Wayland)
# ------------------------------------------------------------------------------

wayland
wl-clipboard

sway
swaybg
swaylock
swayidle

grim
slurp


# ------------------------------------------------------------------------------
# Fonts / Themes
# ------------------------------------------------------------------------------

qt5ct
qt6ct
# arc-gtk-theme (AUR)

noto-fonts
noto-fonts-cjk
noto-fonts-emoji

nerd-fonts
ttf-nerd-fonts-symbols

ttf-font-awesome
papirus-icon-theme


# ------------------------------------------------------------------------------
# Drivers
# ------------------------------------------------------------------------------

linux
linux-headers
linux-firmware
acpi

networkmanager
network-manager-applet

alsa-firmware
alsa-tools
alsa-utils
pulseaudio
pulseaudio-alsa
pulseaudio-jack
pavucontrol
jack2

xf86-input-wacom
libwacom

v4l2loopback-dkms

bluez
bluez-utils

cups
cups-pdf
sane
# xsane (AUR)

ntfs-3g
dosfstools
udisks2
usbutils

android-tools
gvfs
gvfs-mtp
libmtp


# ------------------------------------------------------------------------------
# System core
# ------------------------------------------------------------------------------

man-db
man-pages
texinfo

base
base-devel

reflector
stow
which

bat
fzf
ripgrep
fd
jq

htop
btop
lsof


# ------------------------------------------------------------------------------
# Utilities / commands
# ------------------------------------------------------------------------------

zip
7zip
unzip
tar
unrar
gzip
bzip2

rsync
# adb-sync (AUR)

openssh
curl
inetutils
nmap

ltrace
strace


# ------------------------------------------------------------------------------
# Consoles
# ------------------------------------------------------------------------------

alacritty
rxvt-unicode
tmux

bash
bash-completion

zsh
zsh-completions
zsh-autosuggestions
zsh-syntax-highlighting
# oh-my-posh (AUR)


# ------------------------------------------------------------------------------
# Programming
# ------------------------------------------------------------------------------

git
git-lfs
git-delta
tk

# visual-studio-code-bin (AUR, or use code)
zed
neovim

docker
docker-compose

gcc
clang
make
cmake
xmake
gdb
valgrind
cppcheck
shellcheck
shfmt

rustup
lua
python
python-pip
texlive-core

godot
# unityhub (AUR)

dotnet-runtime
dotnet-sdk


# ------------------------------------------------------------------------------
# Media
# ------------------------------------------------------------------------------

yazi
pcmanfm
filelight
# czkawka (AUR)

viewnior
chafa
ueberzugpp
imagemagick

vlc
mpv
ffmpeg

mupdf


# ------------------------------------------------------------------------------
# Softwares
# ------------------------------------------------------------------------------

krita
blender
darktable
kdenlive
reaper
scribus
libreoffice-fresh
# pureref (AUR)

discord
obs-studio

veracrypt
cryptsetup
keepassxc

firefox
obsidian
# sleek (AUR)
# tidal (AUR)
# anki (AUR)
