stow
ttf-dejavu

autorandr

notification-daemon

alacritty

git
tk

arc-gtk-theme
arc-icon-theme
ttf-roboto
ttf-roboto-mono
papirus-icon-theme

i3-gaps
i3status
i3blocks
i3lock
ttf-font-awesome
dmenu
arandr
nitrogen
xautolock
dex

neovim
python-neovim
xclip

picom

python

ranger
atool
ffmpegthumbnailer
highlight
mediainfo
perl-image-exiftool
poppler
python-chardet
w3m

zsh
zsh-completions
zsh-syntax-highlighting
zsh-theme-powerlevel10k

bash
bash-completion

nemo
nemo-preview
nemo-terminal
ffmpegthumbnailer

code

rxvt-unicode

xorg-xinit