# Pacman packages list for basic archlinux system

stow

# ------------------------------------------------------------------------------
# System
# ------------------------------------------------------------------------------

networkmanager
acpi
xf86-input-wacom

linux
linux-firmware
linux-lts-docs
linux-lts-headers


# ------------------------------------------------------------------------------
# System utilities
# ------------------------------------------------------------------------------

zip
unzip
tar
unrar
gzip
bzip2

rsync
ntfs-3g
openssh
htop


# ------------------------------------------------------------------------------
# Documentation
# ------------------------------------------------------------------------------

man-db
man-pages
texinfo


# ------------------------------------------------------------------------------
# Sound
# ------------------------------------------------------------------------------

alsa-firmware
alsa-tools
alsa-utils

pulseaudio
pulseaudio-alsa


# ------------------------------------------------------------------------------
# Android
# ------------------------------------------------------------------------------

android-tools
usbutils
gvfs-mtp
libmtp


# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------

noto-fonts
noto-fonts-cjk
noto-fonts-emoji