# Pacman package for console

stow

# ------------------------------------------------------------------------------
# Zsh
# ------------------------------------------------------------------------------

zsh
zsh-completions
zsh-syntax-highlighting
zsh-theme-powerlevel10k


# ------------------------------------------------------------------------------
# Bash
# ------------------------------------------------------------------------------

bash
bash-completion


# ------------------------------------------------------------------------------
# Consoles
# ------------------------------------------------------------------------------

alacritty
rxvt-unicode


# ------------------------------------------------------------------------------
# Ranger console file manager
# ------------------------------------------------------------------------------

ranger

atool
ffmpegthumbnailer
highlight
mediainfo
odt2txt
perl-image-exiftool
poppler
python-chardet
w3m
fontimage
